# Esercitazione Data Analytics

## Importiamo il package pandas e verifichiamo la sua versione

In [49]:
import pandas as pd
pd.__version__

'1.2.0'

## Qual è l'output della seguente istruzione?

In [50]:
df = pd.DataFrame({'fee':{'a':1, 'b':2}, 'foo':{'c':3, 'd':4}})
print(df)

   fee  foo
a  1.0  NaN
b  2.0  NaN
c  NaN  3.0
d  NaN  4.0

## Leggiamo un file da csv

In [51]:
df = pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

## Recuperiamo i primi 5 elementi (Default)

In [52]:
print(df.head())

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

## Recuperiamo i primi 10 elementi

In [53]:
print(df.head(10))

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

## Recuperiamo il tipo di una specifica colonna

In [54]:
print(df['salary'].dtype)

int64

## Recuperiamo i tipi di tutte le variabili

In [55]:
print(df.dtypes)

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

## Quanti record possiede questo Dataframe?

In [56]:
print(df.shape)

(78, 6)

## Quanti elementi ci sono?

In [57]:
print(df.size)

468

## Quali sono i nomi delle colonne?

In [58]:
print(df.columns)

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

## Fornire il riepilogo per le colonne numeriche nel set di dati

In [59]:
df.describe(include=['int64'])

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

## Calcolare la deviazione standard per tutte le colonne numeriche

In [60]:
df.std(numeric_only=True)

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

## Quali sono i valori medi dei primi 50 record nel set di dati?

In [61]:
df.head(50).mean(numeric_only=True)

phd            21.52
service        17.60
salary     113789.14
dtype: float64

## Column Slicing

In [62]:
df['salary']
#NB: l'output è una Serie

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

## Seleziona più colonne

In [63]:
df[['salary', 'phd']]
#NB: l'output è un DataFrame

    salary  phd
0   186960   56
1    93000   12
2   110515   23
3   131205   40
4   104800   20
..     ...  ...
73  105450   18
74  104542   19
75  124312   17
76  109954   28
77  109646   23

[78 rows x 2 columns]

## Filtraggio

### Seleziona i professori con salario maggiore di 120000

In [64]:
df[df['salary'] > 120000]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
3   Prof          A   40       31    Male  131205
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
10  Prof          B   39       33    Male  128250
11  Prof          B   23       23    Male  134778
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
29  Prof          B   21       20    Male  123683
31  Prof          B   22       21    Male  155750
35  Prof          B   28       23    Male  126933
36  Prof          B   45       45    Male  146856
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
58  Prof          B   36       26  Female  144651
72  Prof          B   24       15  Female  161101
75  Prof          B   17       17  Female  124312

## Calcola quanti valori sono presenti nella variabile 'salary'

In [65]:
df['salary'].count()

78

## Calcola lo stipendio medio

In [66]:
round(df['salary'].mean(), 2)

108023.78

## Seleziona le professoresse di sesso femminile con stipendio superiore a 120000

In [67]:
female = df[df['sex'] == 'Female']
female[female['salary'] > 120000]

    rank discipline  phd  service     sex  salary
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
58  Prof          B   36       26  Female  144651
72  Prof          B   24       15  Female  161101
75  Prof          B   17       17  Female  124312

## Seleziona la colonna 'salary' delle professoresse di sesso femminile

In [68]:
female = df[df['sex'] == 'Female']
female['salary']

39    129000
40    137000
41     74830
42     80225
43     77000
44    151768
45    140096
46     74692
47    103613
48    111512
49    122960
50     97032
51    127512
52    105000
53     73500
54     62884
55     72500
56     77500
57     72500
58    144651
59    103994
60     92000
61    103750
62    109650
63     91000
64     73300
65    117555
66     63100
67     90450
68     77500
69    116450
70     78500
71     71065
72    161101
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, dtype: int64

Se è necessario selezionare un intervallo di righe, utilizzando le relative label e
colonne possiamo usare metodo *loc*

In [69]:
df.loc[10:20, ['rank', 'sex', 'salary', 'phd']]

        rank   sex  salary  phd
10      Prof  Male  128250   39
11      Prof  Male  134778   23
12  AsstProf  Male   88000    1
13      Prof  Male  162200   35
14      Prof  Male  153750   25
15      Prof  Male  150480   17
16  AsstProf  Male   75044    8
17  AsstProf  Male   92000    4
18      Prof  Male  107300   19
19      Prof  Male  150500   29
20  AsstProf  Male   92000    4

Se dobbiamo selezionare un intervallo di righe e / o colonne,
usando le loro posizioni possiamo usare il metodo *iloc*:

In [70]:
df.iloc[10:20, [0,3,4]]

        rank  service   sex
10      Prof       33  Male
11      Prof       23  Male
12  AsstProf        0  Male
13      Prof       33  Male
14      Prof       19  Male
15      Prof        3  Male
16  AsstProf        3  Male
17  AsstProf        0  Male
18      Prof        7  Male
19      Prof       27  Male

È possibile utilizzare il metodo *applymap* per i Dataframe e il metodo *map* per le Series
Per esempio, se vogliamo aggiornare la colonna 'salary' con il valore espresso in dollari

In [71]:
def dollar_convert(x):
    return x*1.16

df['salary'].map(dollar_convert)

0     216873.60
1     107880.00
2     128197.40
3     152197.80
4     121568.00
        ...
73    122322.00
74    121268.72
75    144201.92
76    127546.64
77    127189.36
Name: salary, Length: 78, dtype: float64

È possibile effettuare dei raggruppamenti tramite *groupby*

In [72]:
df.groupby(['sex','phd'])